Revit 2026 API

# ExportLayerTableIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyValuePair<ExportLayerKey, ExportLayerInfo> Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportLayerKey, ExportLayerInfo)
	Get
```
```cpp
public:
virtual property KeyValuePair<ExportLayerKey^, ExportLayerInfo^> Current {
	KeyValuePair<ExportLayerKey^, ExportLayerInfo^> get ();
}
```
```fsharp
abstract Current : KeyValuePair<ExportLayerKey, ExportLayerInfo> with get
override Current : KeyValuePair<ExportLayerKey, ExportLayerInfo> with get
```

#### Property Value

KeyValuePairExportLayerKey, ExportLayerInfo

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ExportLayerTableIterator Class

Autodesk.Revit.DB Namespace